## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.rds will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "rds" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # helm_release.inferno will be created
  + resource "helm_release" "inferno" {
      + atomic                     = false
      + chart                      = "../helm/inferno"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "dev-inferno"
      + namespace                  = "dev-inferno"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = true
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ingress:
                  hostnames:
                    - example.inferno.sparked-fhir.com
                    - example.inferno.hl7.org.au
                
                inferno:
                  imageUrl: "ghcr.io/hl7au/au-fhir-inferno:68270162fcc1997a9ffac63c78530921bf0f32cf"
                  terminologyServer: "https://tx.dev.hl7.org.au/fhir"
                  externalValidatorUrl: null  # This can be overridden during chart deployment
                  validatorImageUri: "markiantorno/validator-wrapper:1.0.68"
                
                controller:
                  enabled: false # Set to true to enable the ingress controller if you have not already installed it, multiple ingress controllers can be installed via https://kubernetes.github.io/ingress-nginx/user-guide/multiple-ingress/
                  ingressClass: "nginx"
                  ingressClassResource:
                    name: nginx
                    enabled: true
                    default: false
                  service:
                    annotations:
                      service.beta.kubernetes.io/aws-load-balancer-type: "nlb"
                
                postgresql:
                  enabled: false # enable if not using rds from aws-impl
                  externaldbhost: null # This can be overridden during chart deployment
                  containerPorts:
                    postgresql: 5432
                  global:
                    postgresql:
                      auth:
                        username: "postgres"
                        password: "password"
                        database: "inferno"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.2.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "inferno.imageUrl"
          + value = "ghcr.io/hl7au/au-fhir-inferno:7a78c7ce86294055090ae7379ba3eefd1f6f128f-dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "inferno.usesWrapper"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "inferno.validatorImageUri"
          + value = "markiantorno/validator-wrapper:1.0.68"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "ingress.hostnames[0]"
          + value = "dev.inferno.sparked-fhir.com"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "ingress.hostnames[1]"
          + value = "inferno.dev.hl7.org.au"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "nginx.example"
          + value = "12345"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "nginx.platformImageUri"
          + value = "ghcr.io/hl7au/au-fhir-inferno:7a78c7ce86294055090ae7379ba3eefd1f6f128f-nginx-dev"
            # (1 unchanged attribute hidden)
        }

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Inferno PostgreSQL security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "dev-inferno-postgresql-security-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "GithubRepo" = "https://github.com/hl7au/au-fhir-inferno"
          + "Name"       = "dev-inferno"
        }
      + tags_all               = {
          + "GithubRepo" = "https://github.com/hl7au/au-fhir-inferno"
          + "Name"       = "dev-inferno"
        }
      + vpc_id                 = "vpc-0cfa9bf7950074c37"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Inferno PostgreSQL access from within VPC"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "inferno"
      + db_subnet_group_name                  = "sparked-k8s-vpc"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "dev-inferno-postgresql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "GithubRepo" = "https://github.com/hl7au/au-fhir-inferno"
          + "Name"       = "dev-inferno"
        }
      + tags_all                              = {
          + "GithubRepo" = "https://github.com/hl7au/au-fhir-inferno"
          + "Name"       = "dev-inferno"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.rds.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "dev-inferno-postgresql"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>